Autodesk.Revit.DB.Workset.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new workset.
document:
The document in which the new instance is created.
name:
The workset name.
Returns:
Returns the newly created workset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given workset name is already in use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015 Subscription Update

Autodesk.Revit.DB.Workset.IsVisibleByDefault
Whether the workset is visible by default.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
WorksetDefaultVisibilitySettings is not applicable to family documents.
Since:
2012

Autodesk.Revit.DB.Workset.IsEditable
Whether the workset is editable.
Remarks:
The workset is editable if owned by current user.
Since:
2012

Autodesk.Revit.DB.Workset.IsOpen
Whether the workset is open (rather than closed).
Remarks:
The intent of closing a workset is to ask Revit to not display or expand any element in the workset, to reduce memory usage.
Note that open/closed status is independent of editability.
Since:
2012

Autodesk.Revit.DB.Workset.Kind
Kind of the workset.
Since:
2012

Autodesk.Revit.DB.Workset
Represents a workset in the document.
Remarks:
Worksets are a way to divide a set of elements in the Revit document into subsets for worksharing.
There may be one or many worksets in a document.
Each element in the document must belong to one and only one workset.
Since:
2012